[
    {
        "id": "companion-cube",
        "name": "Companion Cube",
        "image": "./assets/discord/companion-cube.png",
        "description": [
            "Companion Cube is a simple DSharpPlus-based bot. It's primary purpose is to show some of the finer functionality of DSharpPlus in action. On top of that, it offers some basic amenities useful when organizing common information in your server."
        ],
        "details": [
            "Among the functionality it offers is tag system, unicode codepoint info, and emoji management. It's very configurable, allows ignoring entire channels, as well as setting prefixes on per-guild basis."
        ],
        "applicationId": "276042646693216258",
        "permissions": 0,
        "source": "https://github.com/Emzi0767/Discord-Companion-Cube-Bot",
        "help": "help",
        "prefixes": [ true, "cc!", "//", "??" ],
        "mention": "Companion Cube"
    },
    {
        "id": "music-turret",
        "name": "Music Turret",
        "image": "./assets/discord/music-turret.png",
        "description": [
            "Music Turret was originally part of Companion Cube, however I since split it off into a standalone bot, cleaned it up, and shipped it. The fixes and cleanups were later backported to Companion Cube. Turret is a Lavalink-based music bot, with standard music bot features, and some extras. It's only added to servers I trust, and, as such, requires that either I add it, or that you contact me if you want to make use of it."
        ],
        "details": [
            "Basic configuration features are identical to those of Companion Cube, that is the bot allows ignoring entire channels, and setting prefixes on per-guild basis. The music suite offers playback from popular services like YouTube or SoundCloud, queueing and queue management, shuffling, volume controls, seeking, and other features.",
            "Turret is inspired by turrets from Portal 2, which sung Cara Mia Addio in the outro of the game."
        ],
        "applicationId": "469727979614765066",
        "permissions": 0,
        "source": "https://github.com/Emzi0767/Discord-Music-Turret-Bot",
        "help": "help",
        "prefixes": [ true, "t!", "..", ">>" ],
        "mention": "Turret"
    },
    {
        "id": "asm",
        "name": "ASM Bot",
        "image": "./assets/discord/asm.png",
        "description": [
            "ASM (Assembler) is a bot that assembles assembly code to machine code, and outputs the resulting hex. Written using Discord.py library."
        ],
        "details": [
            "It supports x86, x86_64, ARMv6, ARMv7, ARMv8, AArch64, MIPS, PowerPC, and PowerPC64 input."
        ],
        "applicationId": "283200903937261569",
        "permissions": 0,
        "source": "https://github.com/Emzi0767/Discord-ASM-Bot",
        "help": "help",
        "prefixes": [ true ],
        "mention": "Assembler"
    }
]
